Case file/0/UB
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15200
(
(3.73625 0.00557083 0)
(3.7171 0.0127374 0)
(3.70077 0.016517 0)
(3.6784 0.0181692 0)
(3.65805 0.018548 0)
(3.6315 0.0185459 0)
(3.60789 0.0184249 0)
(3.57874 0.018525 0)
...
)
;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (3.75 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
