Case file/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 -11)
    (100 0 -11)
    (100 -20 -11)
    (140 -20 -11)
    (140 0 -11)
    (240 0 -11)
    (240 60 -11)
    (140 60 -11)
    (100 60 -11)
    (0 60 -11)
    (0 0 11)
    (100 0 11)
    (100 -20 11)
    (140 -20 11)
    (140 0 11)
    (240 0 11)
    (240 60 11)
    (140 60 11)
    (100 60 11)
    (0 60 11)
);

blocks
(
    //hex (0 1 8 9 10 11 18 19) (200 120 44) simpleGrading (1 1 1)
    //hex (2 3 4 1 12 13 14 11) (80 40 44) simpleGrading (1 1 1)
    //hex (1 4 7 8 11 14 17 18) (80 120 44) simpleGrading (1 1 1)
    //hex (4 5 6 7 14 15 16 17) (200 120 44) simpleGrading (1 1 1)
    
    //hex (0 1 8 9 10 11 18 19) (100 60 22) simpleGrading (1 1 1)
    //hex (2 3 4 1 12 13 14 11) (40 20 22) simpleGrading (1 1 1)
    //hex (1 4 7 8 11 14 17 18) (40 60 22) simpleGrading (1 1 1)
    //hex (4 5 6 7 14 15 16 17) (100 60 22) simpleGrading (1 1 1)
    
    hex (0 1 8 9 10 11 18 19) (100 60 1) simpleGrading (1 1 1)
    hex (2 3 4 1 12 13 14 11) (40 20 1) simpleGrading (1 1 1)
    hex (1 4 7 8 11 14 17 18) (40 60 1) simpleGrading (1 1 1)
    hex (4 5 6 7 14 15 16 17) (100 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (19 18 8 9)
            (18 17 7 8)
            (17 16 6 7)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (10 19 9 0)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (5 6 16 15)
        );
    }
    
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (12 11 1 2)
            (2 3 13 12)
            (3 4 14 13)
            (4 5 15 14)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (9 8 1 0)
            (1 4 3 2)
            (8 7 4 1)
            (7 6 5 4)
            (10 11 18 19)
            (12 13 14 11)
            (11 14 17 18)
            (14 15 16 17)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
